tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Run your GitHub Actions locally 🚀
brew "act"
# All in one for **env
brew "anyenv"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Distributed revision control system
brew "git"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Application launcher and productivity software
cask "alfred"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
